In [1]:
# Importando o SQLITE3
import sqlite3

In [2]:
# Conectando ao banco de dados (ou criando-o se não existir)
conexao = sqlite3.connect('banco.db')

In [3]:
#Criando um cursor para executar comandos SQL
cursor = conexao.cursor()

In [4]:
#Criando uma tabela chamada "alunos" com os seguintes campos: id(inteiro), nome (texto), idade (inteiro) e curso (texto).
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));')

In [5]:
# Verificando se a tabela alunos foi criada
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name='alunos';")
result = cursor.fetchone()

if result:
    print("Tabela 'alunos' criada com sucesso!")
else:
    print("Tabela 'alunos' não encontrada.")

Tabela 'alunos' criada com sucesso!

In [6]:
# Inserir 5 registros na tabela "alunos"
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(1,"Michele Farias" , 35 , "Data Science")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(2,"Renilda Anjos" , 50 , "Administração")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(3,"Kleice Sá" , 43 , "artesã")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(4,"Luis Marcos" , 34 , "Motorista")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(5,"Ravi Daniel" , 20 , "Enfermeiro")')

In [7]:
# Salvando as alterações
conexao.commit()

**Escrevendo consultas SQL para realizar as seguintes tarefas:**

In [8]:
# a) Selecionando todos os registros da tabela "alunos"
cursor.execute('SELECT * FROM alunos')
result = cursor.fetchall()
print(result)

[(1, 'Michele Farias', 35, 'Data Science'), (2, 'Renilda Anjos', 50, 'Administração'), (3, 'Kleice Sá', 43, 'artesã'), (4, 'Luis Marcos', 34, 'Motorista'), (5, 'Ravi Daniel', 20, 'Enfermeiro')]

In [9]:
# b) Selecionar o nome e a idade dos alunos com mais de 20 anos
cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
registros = cursor.fetchall()
for registro in registros:
    print(f'Nome: {registro[0]}, Idade: {registro[1]}')

Nome: Michele Farias, Idade: 35
Nome: Renilda Anjos, Idade: 50
Nome: Kleice Sá, Idade: 43
Nome: Luis Marcos, Idade: 34

In [10]:
# c) Selecionar os alunos do curso de "Data Science" em ordem alfabética

cursor.execute('SELECT nome FROM alunos WHERE curso = "Data Science" ORDER BY nome ASC')
registros = cursor.fetchall()
for registro in registros:
    print(f'Nome: {registro[0]}')

Nome: Michele Farias

In [11]:
# Contar o número total de alunos na tabela
# cursor.fetchone()[0] >>> Retorna o resultado da consulta como uma tupla / O 0 acessa o primeiro (e único) valor da tupla, que é o total de alunos.
cursor.execute('SELECT COUNT(*) FROM alunos')
total_alunos = cursor.fetchone()[0]
print(f'Total de alunos: {total_alunos}')

Total de alunos: 5

**Atualização e Remoção da tabela alunos**

In [12]:
# Atualize a idade de um aluno específico na tabela
# 1º definindo o ID do aluno e a nova dade para qal será alterada.
aluno_id = 2
nova_idade = 56
cursor.execute('UPDATE alunos SET idade = ? WHERE id = ?', (nova_idade, aluno_id))
conexao.commit()

In [13]:
# Verificar se foi feita a atualização
cursor.execute('SELECT * FROM alunos WHERE id = ?', (aluno_id,))
registro = cursor.fetchone()
print(f'Id: {registro[0]}, Nome: {registro[1]}, Idade: {registro[2]}, Curso: {registro[3]}')

Id: 2, Nome: Renilda Anjos, Idade: 56, Curso: Administração

In [14]:
# Remova um aluno pelo seu ID
aluno_id = 4
cursor.execute('DELETE FROM alunos WHERE id = ?', (aluno_id,))
conexao.commit()

In [15]:
# Verificar se o aluno foi removido
# 1º Definir o ID do aluno a ser removido
aluno_id = 4
cursor.execute('SELECT * FROM alunos WHERE id = ?', (aluno_id,))
registro = cursor.fetchone()
if registro is None:
    print(f'O aluno com ID {aluno_id} foi removido com sucesso.')
else:
    print(f'Erro: O aluno com ID {aluno_id} ainda está presente.')

O aluno com ID 4 foi removido com sucesso.

**Criando nova tabela e inserindo os respectivos registros**

In [16]:
# Criando nova tabela chamada "clientes" com os campos: id (chaveprimária), nome (texto), idade (inteiro) e saldo (float).
# Inserindo os respectivos registros na tabela.
# No SQLite, o tipo de dado usado para números com ponto flutuante é REAL

cursor.execute('CREATE TABLE clientes (id INTEGER PRIMARY KEY, nome TEXT, idade INTEGER, saldo REAL)')
conexao.commit()

In [17]:
# Verificando se a tabela clientes foi criada
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name='clientes';")
result = cursor.fetchone()

if result:
    print("Tabela 'clientes' criada com sucesso!")
else:
    print("Tabela 'clientes' não encontrada.")

Tabela 'clientes' criada com sucesso!

In [18]:
# Inserir 5 registros na tabela "clientes"
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(1," Beyonce Knowles" , 43 ,  50000.00)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(2," Whitney Houston" , 48 ,  40000.00)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(3," Britney Spears" ,42 ,  30000.00)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(4," Tina Turner" , 83 ,  20000.00)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(5," Rihanna Fenty" , 36 ,  15000.00)')
conexao.commit()

**Escrevendo consultas SQL para realizar as seguintes tarefas:**

In [19]:
# b) Selecionar o nome e a idade dos clientes com idade superior 30 anos
cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
registros = cursor.fetchall()
for registro in registros:
    print(f'Nome: {registro[0]}, Idade: {registro[1]}')

Nome:  Beyonce Knowles, Idade: 43
Nome:  Whitney Houston, Idade: 48
Nome:  Britney Spears, Idade: 42
Nome:  Tina Turner, Idade: 83
Nome:  Rihanna Fenty, Idade: 36

In [20]:
# b) Calculando o saldo médio dos clientes
# cursor.fetchone()[0]: Retorna o primeiro (e único) valor da consulta, que é a média dos saldos.

cursor.execute('SELECT AVG(saldo) FROM clientes')
saldo_medio = cursor.fetchone()[0]

# Exibir o saldo médio
print(f'O saldo médio dos clientes é: {saldo_medio:.2f}')  #  Exibe o saldo médio formatado com duas casas decimais

O saldo médio dos clientes é: 31000.00

In [21]:
# c) Encontre o cliente com o saldo máximo

cursor.execute('SELECT nome, saldo FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes)')
cliente_max_saldo = cursor.fetchone()

# Exibir o nome do cliente e o saldo máximo
if cliente_max_saldo:
    print(f'O cliente com o maior saldo é {cliente_max_saldo[0]} com um saldo de {cliente_max_saldo[1]:.2f}')
else:
    print('Nenhum cliente encontrado.')

O cliente com o maior saldo é  Beyonce Knowles com um saldo de 50000.00

In [22]:
# d) Conte quantos clientes têm saldo acima de 1000

cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000')
num_clientes_acima_1000 = cursor.fetchone()[0]

# Exibir o número de clientes
print(f'O número de clientes com saldo acima de 1000 é: {num_clientes_acima_1000}')

O número de clientes com saldo acima de 1000 é: 5

**Atualização e Remoção com Condições**

In [23]:
# a) Atualize o saldo de um cliente específico
# 1º Definir o nome do cliente e o novo saldo
nome_cliente = "Britney Spears"
novo_saldo = 35000.00

# Atualizar o saldo do cliente específico
cursor.execute('UPDATE clientes SET saldo = ? WHERE nome = ?', (novo_saldo, nome_cliente))
conexao.commit()  # Confirmar as mudança

In [24]:
# b) Remova um cliente pelo seu ID.
# 1 # Definir o ID do cliente a ser removido

cliente_id = 3
cursor.execute('DELETE FROM alunos WHERE id = ?', (aluno_id,))
conexao.commit()

In [25]:
# Verificar se a remoção foi bem-sucedida

cursor.execute('SELECT * FROM clientes WHERE id = ?', (cliente_id,))
cliente_removido = cursor.fetchone()

## Junção das Tabelas (compras e clientes)

In [26]:
# 1º >>> Crie uma segunda tabela chamada "compras" com os campos: id(chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real).
# 2º >>> Insira algumas compras associadas a clientes existentes na tabela "clientes".
# 3° >>>Escreva uma consulta para exibir o nome do cliente, o produto e ovalor de cada compra.

cursor.execute('''
CREATE TABLE compras (
    id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    produto TEXT,
    valor REAL,
    FOREIGN KEY(cliente_id) REFERENCES clientes(id)
)
''')

conexao.commit()

In [27]:
# Inseririndo registros na tabela compras

cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (?, ?, ?)', (1, 'Laptop', 2500.00))
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (?, ?, ?)', (2, 'Smartphone', 1200.00))
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (?, ?, ?)', (3, 'Tablet', 800.00))
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (?, ?, ?)', (4, 'Cadeira', 350.00))
cursor.execute('INSERT INTO compras (cliente_id, produto, valor) VALUES (?, ?, ?)', (5, 'Teclado', 150.00))

# Confirmar a inserção dos registros
conexao.commit()

In [28]:
# Escrevendo uma consulta para exibir o nome do cliente, o produto e o valor de cada compra

cursor.execute('''
SELECT clientes.nome, compras.produto, compras.valor
FROM compras
JOIN clientes ON compras.cliente_id = clientes.id
''')

# Obter e exibir os resultados
resultados = cursor.fetchall()
for resultado in resultados:
    print(f'Cliente: {resultado[0]}, Produto: {resultado[1]}, Valor: {resultado[2]:.2f}')

Cliente:  Beyonce Knowles, Produto: Laptop, Valor: 2500.00
Cliente:  Whitney Houston, Produto: Smartphone, Valor: 1200.00
Cliente:  Britney Spears, Produto: Tablet, Valor: 800.00
Cliente:  Tina Turner, Produto: Cadeira, Valor: 350.00
Cliente:  Rihanna Fenty, Produto: Teclado, Valor: 150.00